artillery/artillery.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 50
    - duration: 120
      arrivalRate: 20
scenarios:
  - flow:
      - post:
          url: "/api/book-bus"
          json:
            userId: "user-{{ $randomNumber(1,1000000) }}"
            route: "서울→부산"
            date: "2025-10-06"
            passengers: 1